{"name":"MK/Resource_Packs","user":"2-people","content":"This page shows you how to make and use a resource pack.<br>\nAn example can be found <a href=\"https://thingmaker.us.eu.org/minekhan/assets/resource_packs/example.json\" target=\"_blank\">here</a>.<br>\n\n<h1>Making a resource pack</h1>\n<h2>1. You need to know JSON.</h2>If you already know JSON, continue.<br>\n\n<h2>2. Make a JSON file</h2>\nMake a JSON file with the following text:\n<pre>{\n  \"name\":\"a resource pack\",\n  \"description\":\"something\",\n  \"version\":\"1.0.0\",\n  \"thumbnail\":\"https://example.com\",\n  \"textures\":{},\n  \"images\":{},\n  \"animated\":{},\n  \"texts\":{},\n  \"settings\":{}\n}</pre><br>\nReplace name with the name of your resource pack. Also change description and thumbnail and version. The other properties are optional.\nWhenever you change your resource pack, change version so it will automatically redownload.\n\n<h2>3. Textures</h2>\nTextures are for blocks and entities. You can use the /blockInfo command to get texture names of blocks.\nTo replace a texture or create a new one, add the following to the textures object:\n<ul>\n  <li>The property name is the name of the texture</li>\n  <li>The value is the texture encoded which can be done by opening <a href=\"/tools/textureConvert.html\" target=\"_blank\">this link</a></li>\n</ul>\nThe texture can be any size but it is recommended to be at most 128 &times; 128.\n\n<h2>4. Images</h2>\nImages are similar to textures. You can look for the images in the code.\nTo replace an image, add the following to the images object:\n<ul>\n  <li>The property name is the name of the image</li>\n  <li>The value is the url which can be a data url</li>\n</ul>\n\n<h2>5. Animated textures</h2>\nTo replace an existing animated texture or make an unanimated texture animated, add the following to the animated object:\n<ul>\n  <li>The property name is the name of the texture to animate</li>\n  <li>\n    The value is like this:\n    <pre>{\n  \"time\":20,\n  \"arr\":[],\n  \"interpolate\":false\n}</pre>\n    Where:\n    <ul>\n      <li>time is the amount of ticks between each frame</li>\n      <li>arr is the list of frames. Each item is a texture name.</li>\n      <li>interpolate is a boolean and is optional</li>\n    </ul>\n  </li>\n</ul>\nNote: The frames of the animated texture must be the same size.\n\n<h2>6. Texts</h2>\nYou can replace certain text like button text.<br>\nTo replace text, add the following to the images object:\n<ul>\n  <li>\n    The property name can be:\n    <ul>\n      <li>The text to replace</li>\n      <li>For block and item names, use <pre inline>block.name</pre> and replace name with the name of the block or item in camel case.</li>\n      <li>For control names, use <pre inline>control.name</pre> and replace name with the name of the control in camel case.</li>\n    </ul>\n  </li>\n  <li>The value is the text to replace it with</li>\n</ul>\n\n<h2>7: Other settings</h2>\nThere are other settings. You can change them in the settings object.\nAn example for the settings object:\n<pre>{\n  \"skyBottom\":[1,0,0],\n  \"skyOrange\":[0,1,0],\n  \"sky\":{\n    \"field\":[1,1,0]\n  }\n}</pre>\n\n<h2>Last steps</h2>\nHost the resource pack somewhere and get the url of the json file. You can also host it by <a href=\"/maps/newrp\">uploading it to minekhan.</a><br>\n\n<h1>Using a resource pack</h1>\nGo to options, then resource packs, then click Add from URL.<br>\nInput the url of json file.<br>\nAfter the resource pack appears on the list, click it, then click Done.\n\n<h1>Making a language resource pack</h1>\nLanguage resource packs are similar to normal resource packs.<br>\nLanuage resource packs look like this:<br>\n<pre>{\n  \"name\":\"language name\",\n  \"texts\":{\n    //...\n  }\n}</pre>\nLanuage resource packs use the same format for name and texts.<br>\nInstead of hosting a language resource pack, the file should be sent so that it will show up in the language list.","pwd":"","created":1711066085699,"comments":[{"user":"Caterpillar_fan","content":"AAAAAAAAAAAAAAAA","created":1713669101152,"id":"lv8yc50g4k4j"},{"user":"cheezit_sauce","content":"woah coding fancy","created":1714512945388,"id":"lvmwqne45jcb"}]}